import Foundation

// 【ChaoCode】 Swift 基礎篇 4：文字類型實作作業
// 1. 根據以下已建立的符號，印出衝浪的男人和女人。（失敗時可以嘗試調整順序）

let 衝浪 = "🏄\u{200D}"
let 男人 = "\(衝浪)\u{2642}\u{FE0F}"
let 女人 = "\(衝浪)\u{2640}\u{FE0F}"


print("""
    🐬
🌊🌊🌊🌊🌊\(衝浪)🌊🌊🌊\(女人)🌊\(男人)🌊🌊🌊🌊🌊🏖🌴



""")




// 2. 請 debug 下面的 code，讓皮卡丘和愛心圖案正確印出。如果圖片對你來說太大了可以把第 55 行後刪掉。（包含第 55 行，記得最後的 print 不能刪掉。）

let emoji = "\u{1F495}"
let heartArt =  """
\t\t\t\t\t\t\(emoji)\(emoji)\(emoji)\t   \(emoji)\(emoji)\(emoji)
\t\t\t\t\t  \(emoji)      \(emoji)\(emoji)      \(emoji)
\t\t\t\t\t \(emoji)        \(emoji)        \(emoji)
\t\t\t\t\t \(emoji)                  \(emoji)
\t\t\t\t\t  \(emoji)                \(emoji)
\t\t\t\t\t\t\(emoji)            \(emoji)
\t\t\t\t\t\t  \(emoji)        \(emoji)
\t\t\t\t\t\t\t \(emoji)   \(emoji)
\t\t\t\t\t\t\t   \(emoji)
"""

let s = "" // 這個 s 變數只是加了讓你再複製貼上時圖片不會因為空白鍵被自動吃掉而跑位，可以無視這行，如果你想在你的皮卡丘前面多加一些空白也可以調整這個變數的內容。
let pikachu = """

quu..__
\(s) $$$b  `---.__
\(s)  "$$b        `--.                          ___.---uuudP
\(s)   `$$b           `.__.------.__     __.---'      $$$$"              .
\(s)     "$b          -'            `-.-'            $$$"              .'|
\(s)       ".                                       d$"             _.'  |
\(s)         `.   /                              ..."             .'     |
\(s)           `./                           ..::-'            _.'       |
\(s)            /                         .:::-'            .-'         .'
\(s)           :                          ::''\\          _.'            |
\(s)          .' .-.             .-.           `.      .'               |
\(s)          : /'$$|           .@"$\\           `.   .'              _.-'
\(s)         .'|$u$$|          |$$,$$|           |  <            _.-'
\(s)         | `:$$:'          :$$$$$:           `.  `.       .-'
\(s)         :                  `"--'             |    `-.    \\
\(s)        :##.       ==             .###.       `.      `.   `\\
\(s)        |##:                      :###:        |        >     >
\(s)        |#'     `..'`..'          `###'        x:      /     /
\(s)         \\                                   xXX|     /    ./
\(s)          \\                                xXXX'|    /   ./
\(s)          /`-.                                  `.  /   /
\(s)         :    `-  ...........,                   | /  .'
\(s)         |         ``:::::::'       .            |<    `.
\(s)         |             ```          |           x| \\ `.:``.
\(s)         |                         .'    /'   xXX|  `:`M`M':.
\(s)         |    |                    ;    /:' xXXX'|  -'MMMMM:'
\(s)         `.  .'                   :    /:'       |-'MMMM.-'
\(s)          |  |                   .'   /'        .'MMM.-'
\(s)          `'`'                   :  ,'          |MMM<
\(s)            |                     `'            |tbap\\
\(s)             \\                                  :MM.-'
\(s)              \\                 |              .''
\(s)               \\.               `.            /
\(s)                /     .:::::::.. :           /
\(s)               |     .:::::::::::`.         /
\(s)               |   .:::------------\\       /
\(s)              /   .''               >::'  /
\(s)              `',:                 :    .'
\(s)                                   `:.:'

"""


print(heartArt + "\n" + pikachu)


// 圖片來源：https://www.asciiart.eu/video-games/pokemon by Tim Park
